DECLARE @Документы AS TABLE
(
ндок int,
Дата datetime,
Покупатель_ID int
 )

 INSERT INTO @Документы VALUES (1,'12.12.2012',1)
 INSERT INTO @Документы VALUES (2,'11.12.2010',2)
 INSERT INTO @Документы VALUES (3,'1.2.2012',3)
 INSERT into @Документы values (4,'10.10.2010',1)
 declare @Документы_данные as table (
 ндок int,
 Товар_ID int,
 Цена float,
 Колво int)

 INSERT INTO @Документы_данные VALUES (1,1,10,5)
 INSERT INTO @Документы_данные VALUES (4,1,10,5)
 INSERT INTO @Документы_данные VALUES (2,2,22,2)
 INSERT INTO @Документы_данные VALUES (3, 3,30,1)

 declare @Товары as table (
 Товар_ID int,
 Наименование nvarchar(max),
 Цена float,
 Остаток int,
 Объем float,
 Масса float
 )

 INSERT INTO @Товары VALUES (1,'Капуста',10, 15,2,1)
 INSERT INTO @Товары VALUES (2,'Хлеб', 22, 11, 1, 1)
 INSERT INTO @Товары VALUES (3,'Колбаса',30, 12,1,13)

 declare @Покупатели as table (
 Покупатель_ID int,
 ФИО nvarchar(max)
 )

 insert into @Покупатели values (1, 'Иванов Иван Иванович')
 insert into @Покупатели values (2, 'Сидоров Сидор Петрович')
 insert into @Покупатели values (3, 'Петров Иван Андреевич')

/*2*/
 select Док.ндок, Пок.ФИО
 from @Документы Док inner join @Покупатели Пок
 on Док.Покупатель_ID = Пок.покупатель_ID
 group by Док.ндок, Пок.ФИО

 /*3*/
 select Док.ндок, Пок.ФИО,max(Докд.Цена * Докд.Колво) as Стоимость
 from @Документы Док, @Покупатели Пок, @Документы_данные Докд
 where Док.Покупатель_ID = Пок.Покупатель_ID
 and Док.ндок = Докд.ндок
 group by Докд.Цена, Докд.Колво, Док.ндок,Пок.ФИО
 having max(Докд.Цена * Докд.Колво) = Докд.Цена * Докд.Колво
 

 /*4*/
 declare @a int
 set @a = 1

 select Пок.Фио,Тов.Наименование
 from @Покупатели as Пок, @Товары Тов, @Документы Док,@Документы_данные as Докд
 where Док.Покупатель_ID = Пок.Покупатель_ID 
 and
 Док.ндок = Докд.ндок
 and
 Докд.Товар_ID = Тов.Товар_ID
 and док.Покупатель_ID = @a

 /*5*/
 declare @ДатаС Datetime
 set @ДатаС = '01.02.2011'
 declare @ДатаПО Datetime
 set @ДатаПо = '02.02.2012'

 select Пок.ФИО, count(distinct Тов.Наименование) as Колво
 from @Покупатели as Пок, @Товары Тов, @Документы Док,@Документы_данные as Докд
 where Док.Покупатель_ID = Пок.Покупатель_ID 
 and
 Док.ндок = Докд.ндок
 and
 Докд.Товар_ID = Тов.Товар_ID
 and 
 Док.Дата between @ДатаС and @ДатаПо
 group by Пок.ФИО

 /*6*/
 select Тов.Наименование, count(distinct Пок. Покупатель_ID) as Колво
 from @Покупатели as Пок, @Товары Тов, @Документы Док,@Документы_данные as Докд
 where Док.Покупатель_ID = Пок.Покупатель_ID 
 and
 Док.ндок = Докд.ндок
 and
 Докд.Товар_ID = Тов.Товар_ID
 group by Тов.Наименование


 /*7*/
 select Док.Дата, Пок.ФИО, Док.ндок
 from @Покупатели as Пок, @Товары Тов, @Документы Док,@Документы_данные as Докд
 where Док.Покупатель_ID = Пок.Покупатель_ID 
 and
 Док.ндок = Докд.ндок
 and
 Докд.Товар_ID = Тов.Товар_ID
 group by Док.Дата, Пок.ФИО, Док.ндок, Докд.Колво * Докд.цена
 having min(Докд.Колво * Докд.цена) = Докд.Колво * Докд.цена
 and min(Докд.Колво * Докд.цена) <= 100
 order by Док.дата desc

 /*8*/
 /* ДатаС и ДатаПО уже объявлены ранее*/

 select count(Док. ндок) as 'Колво документов'
 from @Документы as Док
 where Док.Дата between @ДатаС and @ДатаПо

 /*9*/
 declare @Дата datetime
 set @Дата = '12.11.2011'

 select Пок.ФИО
 from @Покупатели as Пок, @Товары Тов, @Документы Док,@Документы_данные as Докд
 where Док.Покупатель_ID = Пок.Покупатель_ID 
 and
 Док.ндок = Докд.ндок
 and
 Докд.Товар_ID = Тов.Товар_ID
 and
 Док.Дата > @Дата
 group by Пок.ФИО, Докд.Цена * Докд.Колво
 having sum(Докд.Цена * Докд.Колво) >= 200
 order by Пок.ФИО asc 

 /*10*/
 select Док.Дата, sum(Докд.Цена * Докд.Колво) as 'Сумма'
 from @Покупатели as Пок, @Товары Тов, @Документы Док,@Документы_данные as Докд
 where Док.Покупатель_ID = Пок.Покупатель_ID 
 and
 Док.ндок = Докд.ндок
 and
 Докд.Товар_ID = Тов.Товар_ID
 group by Док.Дата
 order by Док.Дата desc

 /*11*/
 select Док.ндок,DATEDIFF(dd,Док.Дата, GetDate()) as 'Дней прошло', Докд.Цена * Докд.Колво as 'Стоимость'
 from @Покупатели as Пок inner join @Документы Док
 on Док.Покупатель_ID = Пок.Покупатель_ID 
 inner join @Документы_данные as Докд
 on Док.ндок = Докд.ндок
 inner join @Товары as Тов
 on Докд.Товар_ID = Тов.Товар_ID
 group by Док.ндок, Докд.Цена * Докд.Колво, Док.Дата
 order by (Докд.Цена * Докд.Колво) desc

 /*12*/
 select Пок.Покупатель_ID , Тов.Товар_ID, sum(докд.Колво) as 'Колво'
 from @Покупатели as Пок inner join @Документы Док
 on Док.Покупатель_ID = Пок.Покупатель_ID 
 inner join @Документы_данные as Докд
 on Док.ндок = Докд.ндок
 inner join @Товары as Тов
 on Докд.Товар_ID = Тов.Товар_ID
 group by Пок.Покупатель_ID, Тов.Товар_ID

 /*13*/
 select Пок.ФИО
 from @Покупатели as Пок inner join @Документы Док
 on Док.Покупатель_ID = Пок.Покупатель_ID 
 inner join @Документы_данные as Докд
 on Док.ндок = Докд.ндок
 inner join @Товары as Тов
 on Докд.Товар_ID = Тов.Товар_ID
 where Докд.Цена <> Тов.Цена

 /*14*/
 select Пок.ФИО
 from @Покупатели as Пок inner join @Документы Док
 on Док.Покупатель_ID = Пок.Покупатель_ID 
 inner join @Документы_данные as Докд
 on Док.ндок = Докд.ндок
 inner join @Товары as Тов
 on Докд.Товар_ID = Тов.Товар_ID
 where док.дата between '01.05.2014' and '01.06.2014'
 group by Пок.ФИО
 having sum(Док.ндок) > 1

 /*15*/
 select Док.ндок, Пок.ФИО, (Тов.Масса * Докд.Колво) as 'Масса'
 from @Покупатели as Пок inner join @Документы Док
 on Док.Покупатель_ID = Пок.Покупатель_ID 
 inner join @Документы_данные as Докд
 on Док.ндок = Докд.ндок
 inner join @Товары as Тов
 on Докд.Товар_ID = Тов.Товар_ID
 order by (Тов.Масса * Докд.Колво) asc

 /*16*/
 select Док.ндок, Тов.Наименование, Докд.Цена
 from @Покупатели as Пок inner join @Документы Док
 on Док.Покупатель_ID = Пок.Покупатель_ID 
 inner join @Документы_данные as Докд
 on Док.ндок = Докд.ндок
 inner join @Товары as Тов
 on Докд.Товар_ID = Тов.Товар_ID
 group by Док.ндок, Тов.Наименование, Докд.Цена

 /*17*/
 select Тов.Товар_ID, sum(Тов.Объем * Тов.Остаток)as 'Суммарный объем', sum(Тов.Масса * Тов. Остаток) as 'Суммарный вес'
 from @Покупатели as Пок inner join @Документы Док
 on Док.Покупатель_ID = Пок.Покупатель_ID 
 inner join @Документы_данные as Докд
 on Док.ндок = Докд.ндок
 inner join @Товары as Тов
 on Докд.Товар_ID = Тов.Товар_ID 
 group by Тов.Товар_ID